<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Notion and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.pickorchard.munki.Notion</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps</string>
		<key>NAME</key>
		<string>Notion</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Productivity</string>
			<key>description</key>
			<string>Write, plan and get organized in one place. Customize Notion to work the way you do.</string>
			<key>developer</key>
			<string>Notion Labs, Incorporated</string>
			<key>display_name</key>
			<string>Notion</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>supported_architectures</key>
			<array>
				<string>x86_64</string>
			</array>
	        <key>postinstall_script</key>
        	<string>#! /bin/bash

[ -d /Applications/Notion.app ] &amp;&amp; chmod -R 775 /Applications/Notion.app

exit 0</string>					
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.pickorchard.download.Notion</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
